export const a = [
  {
    id: 1,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: " محصول شرکت اپل iPad",
    image: "/images/ipad.jpg",
    description: [
      "پردازنده قدرتمند: آیپد از پردازنده‌های A-series سفارشی اپل استفاده می‌کند که دارای عملکرد بسیار بالا و مصرف کم انرژی است. این پردازنده‌ها توانایی پردازش سریع و گرافیکی بالا را فراهم می‌کنند که منجر به اجرای سریع و نرم افزارهای دلخواه می‌شود.",
      " صفحه نمایش با کیفیت عالی: آیپد دارای صفحه نمایش Retina با رزولوشن بالا و پوشش ضد خش است. این صفحه نمایش‌ها برای تماشای فیلم‌ها، مشاهده تصاویر با کیفیت بالا، و اجرای برنامه‌های گرافیکی ایده‌آل هستند.",
      "پشتیبانی از Apple Pencil: آیپد به طور کامل از قلم اپل پنسیل پشتیبانی می‌کند که توانایی نقاشی، نوشتن یادداشت، و انجام ویرایش‌های دقیق را فراهم می‌کند.",
    ],

    brand: "Apple",
    category: "Electronic",
    price: 58000000,
    countInStock: 10,
    rating: 4.5,
    numReviews: 12,
  },
  {
    id: 2,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: " محصول شرکت اپل Macbook pro",
    image: "/images/mac pro.jpg",
    description: [
      "راحی زیبا و سبک: با ضخامت نسبتاً کم و وزن سبک، مک‌بوک پرو طراحی شیک و زیبایی دارد که از جنس آلومینیوم ساخته شده و احساسی لوکس به کاربر می‌دهد.",
      "صفحه نمایش با کیفیت بالا: مک‌بوک پرو دارای صفحه نمایش Retina با کیفیت بالا و رزولوشن بالا است که تصاویر و متن‌ها را با وضوح فوق‌العاده‌ای نمایش می‌دهد.",
      "صدای بی‌نظیر: سیستم صوتی پیشرفته مک‌بوک پرو با اسپیکرهای ساخته شده با دقت و تکنولوژی پیشرفته صدایی با کیفیت بالا و پرقدرت را ارائه می‌دهد.",
      "پشتیبانی از Touch Bar: نوار لمسی Touch Bar در بالای صفحه کیبورد مک‌بوک پرو قابلیت‌های مختلفی را ارائه می‌دهد و به کاربر امکان کنترل سریع‌تر و آسان‌تر از برنامه‌ها را می‌دهد.",
    ],

    brand: "Apple",
    category: "Electronic",
    price: 168000000,
    countInStock: 1,
    rating: 4,
    numReviews: 2,
  },
  {
    id: 3,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: " محصول شرکت اپل Macbook air",
    image: "/images/mac air.jpg",
    description: [
      "عملکرد سریع: با پردازنده‌های قدرتمند و فناوری‌های پیشرفته، مک‌بوک ایر توانایی پردازش سریع برنامه‌ها و اجرای کارهای گرافیکی را فراهم می‌کند.",
      "باتری قوی: با باتری با ظرفیت بالا، مک‌بوک ایر به کاربر امکان استفاده طولانی مدت بدون نیاز به شارژ را می‌دهد.",
      " پشتیبانی از Touch ID: با تکنولوژی Touch ID، مک‌بوک ایر امنیت بالایی را برای کاربر فراهم می‌کند و به او امکان ورود به سیستم با استفاده از اثر انگشت را می‌دهد.",
      " پورت‌های متعدد: مک‌بوک ایر دارای پورت‌های متعددی از جمله پورت USB-C و Thunderbolt 3 است که امکان اتصال به دستگاه‌های مختلف را فراهم می‌کند.",
    ],

    brand: "Apple",
    category: "Electronic",
    price: 128000000,
    countInStock: 4,
    rating: 4.5,
    numReviews: 10,
  },
  {
    id: 4,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: " محصول شرکت اپل IMac",
    image: "/images/imac.jpg",
    description: [
      "آی‌مک (iMac) اپل یک کامپیوتر رومیزی هوشمند و قدرتمند است که با طراحی زیبا و عملکرد بالا شناخته می‌شود" +
        " طراحی زیبا و بی‌درنگ: آی‌مک دارای طراحی بسیار زیبا و بی‌درنگ است که توسط اپل طراحی شده و از جنس آلومینیوم ساخته شده است. این طراحی باریک و ساده باعث می‌شود که آی‌مک در هر محیطی بسیار شیک و زیبا به نظر بیاید",
      " عملکرد سریع و قدرتمند: با پردازنده‌های قدرتمند Intel Core و گرافیک پیشرفته، آی‌مک توانایی اجرای برنامه‌های گرافیکی و ویدئویی پرسرعت را داراست. عملکرد بالای آی‌مک مناسب برای کارهای حرفه‌ای و خلاقیت‌های گوناگون است.",
      "پشتیبانی از تکنولوژی‌های متعدد: آی‌مک دارای پورت‌های متعددی از جمله Thunderbolt 3 و USB-C است که امکان اتصال به دستگاه‌های مختلف را فراهم می‌کند. همچنین پشتیبانی از تکنولوژی‌هایی مانند Wi-Fi و بلوتوث نیز در این کامپیوتر وجود دارد.",
    ],

    brand: "Apple",
    category: "Electronic",
    price: 98000000,
    countInStock: 2,
    rating: 4.5,
    numReviews: 8,
  },
  {
    id: 5,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: " محصول شرکت اپل IMac",
    image: "/images/imac.jpg",
    description: [
      "آی‌مک (iMac) اپل یک کامپیوتر رومیزی هوشمند و قدرتمند است که با طراحی زیبا و عملکرد بالا شناخته می‌شود",
      " طراحی زیبا و بی‌درنگ: آی‌مک دارای طراحی بسیار زیبا و بی‌درنگ است که توسط اپل طراحی شده و از جنس آلومینیوم ساخته شده است. این طراحی باریک و ساده باعث می‌شود که آی‌مک در هر محیطی بسیار شیک و زیبا به نظر بیاید",
      " عملکرد سریع و قدرتمند: با پردازنده‌های قدرتمند Intel Core و گرافیک پیشرفته، آی‌مک توانایی اجرای برنامه‌های گرافیکی و ویدئویی پرسرعت را داراست. عملکرد بالای آی‌مک مناسب برای کارهای حرفه‌ای و خلاقیت‌های گوناگون است.",
      "پشتیبانی از تکنولوژی‌های متعدد: آی‌مک دارای پورت‌های متعددی از جمله Thunderbolt 3 و USB-C است که امکان اتصال به دستگاه‌های مختلف را فراهم می‌کند. همچنین پشتیبانی از تکنولوژی‌هایی مانند Wi-Fi و بلوتوث نیز در این کامپیوتر وجود دارد.",
    ],

    brand: "Apple",
    category: "Electronic",
    price: 98000000,
    countInStock: 2,
    rating: 4.5,
    numReviews: 8,
  },
  {
    id: 6,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: " محصول شرکت اپل Apple Watch",
    image: "/images/watch.jpg",
    description: [
      "اپل واچ از سیستم عامل watchOS پشتیبانی می‌کند که توسط اپل توسعه داده شده است.سیستم عامل watchOS امکاناتی مانند نمایش اعلان‌ها، اجرای برنامه‌ها، پیام‌رسانی و نظارت بر فعالیت‌های ورزشی را فراهم می‌کند.",

      " اپل واچ قابلیت نظارت بر فعالیت‌های روزانه مانند تعداد قدم‌ها، مسافت طی شده و کالری سوزانده را فراهم می‌کند.   قابلیت‌های بهبود سلامتی از جمله نظارت بر ضربان قلب، اندازه‌گیری فشار خون و انجام الکتروکاردیوگرافی (ECG) را داراست. ",

      " قابلیت‌های ارتباطی شامل تماس‌ها، پیام‌رسانی، ایمیل و پرداخت‌های بی‌سر و صدا از طریق Apple Pay است. امکان استفاده از برنامه‌های شخص ثالث از جمله برنامه‌های بهداشت و سلامت، مدیریت زمان و برنامه‌های آب و هوا.",
    ],

    brand: "Apple",
    category: "Electronic",
    price: 28000000,
    countInStock: 9,
    rating: 3.5,
    numReviews: 8,
  },
  {
    id: 7,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: "محول شرکت دل Del",
    image: "/images/del.jpg",
    description: [
      "راحی زیبا و سبک: با ضخامت نسبتاً کم و وزن سبک، مک‌بوک پرو طراحی شیک و زیبایی دارد که از جنس آلومینیوم ساخته شده و احساسی لوکس به کاربر می‌دهد.",
      "صفحه نمایش با کیفیت بالا: مک‌بوک پرو دارای صفحه نمایش Retina با کیفیت بالا و رزولوشن بالا است که تصاویر و متن‌ها را با وضوح فوق‌العاده‌ای نمایش می‌دهد.",
      "صدای بی‌نظیر: سیستم صوتی پیشرفته مک‌بوک پرو با اسپیکرهای ساخته شده با دقت و تکنولوژی پیشرفته صدایی با کیفیت بالا و پرقدرت را ارائه می‌دهد.",
      "پشتیبانی از Touch Bar: نوار لمسی Touch Bar در بالای صفحه کیبورد مک‌بوک پرو قابلیت‌های مختلفی را ارائه می‌دهد و به کاربر امکان کنترل سریع‌تر و آسان‌تر از برنامه‌ها را می‌دهد.",
    ],

    brand: "Del",
    category: "Electronic",
    price: 54000000,
    countInStock: 2,
    rating: 4,
    numReviews: 3,
  },
  {
    id: 8,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: "محصول شرکت اپل iphone 14 ",
    image: "/images/iphone 14.jpg",

    description: [
      " آیفون 14 از تمامی قابلیت‌های تماس‌های صوتی و تصویری بهره می‌برد. کیفیت صدا و تصویری بسیار بالا، فناوری‌های حذف نویز و بهینه‌سازی صدا برای تجربه تماسی کاملاً واضح و باکیفیت ارائه می‌کند",
      " پیام‌رسانی: با آیفون 14 می‌توانید به راحتی از طریق پیام‌رسانی‌های متنی، تصویری و صوتی با دوستان و خانواده خود ارتباط برقرار کنید. اپلیکیشن پیام‌رسانی اپل، امکاناتی مانند ارسال پیام‌های پیشرفته، استفاده از استیکرها و امکان به اشتراک گذاری فایل‌های بزرگ را فراهم می‌کند.",

      " ایمیل: با آیفون 14، می‌توانید به راحتی ایمیل‌های خود را مدیریت کنید. برنامه ایمیل اپل از امکاناتی مانند جعبه ایمیل‌های تفکیک شده، نمایش پیش‌نمایش‌های ایمیل و سریعترین روش برای پاسخ به ایمیل‌ها بهره می‌برد.",
    ],

    brand: "apple",
    category: "Electronic",
    price: 48000000,
    countInStock: 8,
    rating: 4,
    numReviews: 3,
  },
  {
    id: 9,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: "محصول شرکت اپل iphone 15 ",
    image: "/images/iphone 15.jpg",

    description: [
      " آیفون 15 از تمامی قابلیت‌های تماس‌های صوتی و تصویری بهره می‌برد. کیفیت صدا و تصویری بسیار بالا، فناوری‌های حذف نویز و بهینه‌سازی صدا برای تجربه تماسی کاملاً واضح و باکیفیت ارائه می‌کند",
      " پیام‌رسانی: با آیفون 14 می‌توانید به راحتی از طریق پیام‌رسانی‌های متنی، تصویری و صوتی با دوستان و خانواده خود ارتباط برقرار کنید. اپلیکیشن پیام‌رسانی اپل، امکاناتی مانند ارسال پیام‌های پیشرفته، استفاده از استیکرها و امکان به اشتراک گذاری فایل‌های بزرگ را فراهم می‌کند.",

      " ایمیل: با آیفون 14، می‌توانید به راحتی ایمیل‌های خود را مدیریت کنید. برنامه ایمیل اپل از امکاناتی مانند جعبه ایمیل‌های تفکیک شده، نمایش پیش‌نمایش‌های ایمیل و سریعترین روش برای پاسخ به ایمیل‌ها بهره می‌برد.",
    ],

    brand: "apple",
    category: "Electronic",
    price: 56000000,
    countInStock: 8,
    rating: 4,
    numReviews: 3,
  },
  {
    id: 10,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: "محول شرکت ماکروسافت surface ",
    image: "/images/surface.jpg",

    description: [
      " آیفون 15 از تمامی قابلیت‌های تماس‌های صوتی و تصویری بهره می‌برد. کیفیت صدا و تصویری بسیار بالا، فناوری‌های حذف نویز و بهینه‌سازی صدا برای تجربه تماسی کاملاً واضح و باکیفیت ارائه می‌کند",
      " پیام‌رسانی: با آیفون 14 می‌توانید به راحتی از طریق پیام‌رسانی‌های متنی، تصویری و صوتی با دوستان و خانواده خود ارتباط برقرار کنید. اپلیکیشن پیام‌رسانی اپل، امکاناتی مانند ارسال پیام‌های پیشرفته، استفاده از استیکرها و امکان به اشتراک گذاری فایل‌های بزرگ را فراهم می‌کند.",

      " ایمیل: با آیفون 14، می‌توانید به راحتی ایمیل‌های خود را مدیریت کنید. برنامه ایمیل اپل از امکاناتی مانند جعبه ایمیل‌های تفکیک شده، نمایش پیش‌نمایش‌های ایمیل و سریعترین روش برای پاسخ به ایمیل‌ها بهره می‌برد.",
    ],

    brand: "microsoft",
    category: "Electronic",
    price: 106000000,
    countInStock: 8,
    rating: 4,
    numReviews: 3,
  },
  {
    id: 11,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: "محصول شرکت گوگل google phone",
    image: "/images/g phone.jpg",

    description: [
      " آیفون 15 از تمامی قابلیت‌های تماس‌های صوتی و تصویری بهره می‌برد. کیفیت صدا و تصویری بسیار بالا، فناوری‌های حذف نویز و بهینه‌سازی صدا برای تجربه تماسی کاملاً واضح و باکیفیت ارائه می‌کند",
      " پیام‌رسانی: با آیفون 14 می‌توانید به راحتی از طریق پیام‌رسانی‌های متنی، تصویری و صوتی با دوستان و خانواده خود ارتباط برقرار کنید. اپلیکیشن پیام‌رسانی اپل، امکاناتی مانند ارسال پیام‌های پیشرفته، استفاده از استیکرها و امکان به اشتراک گذاری فایل‌های بزرگ را فراهم می‌کند.",

      " ایمیل: با آیفون 14، می‌توانید به راحتی ایمیل‌های خود را مدیریت کنید. برنامه ایمیل اپل از امکاناتی مانند جعبه ایمیل‌های تفکیک شده، نمایش پیش‌نمایش‌های ایمیل و سریعترین روش برای پاسخ به ایمیل‌ها بهره می‌برد.",
    ],

    brand: "google",
    category: "Electronic",
    price: 47000000,
    countInStock: 2,
    rating: 3,
    numReviews: 5,
  },
  {
    id: 12,
    color: [
      { color: "زرد", code: "#FFC100" },
      { color: "خاکستری", code: "#C7C8CC" },
      { color: "سورمه ای", code: "#211951" },
    ],
    name: "محصول شرکت اپل air pod ",
    image: "/images/airpod.jpg",

    description: [
      "AirPods دارای طراحی ساده و کوچکی هستند که به راحتی در گوش قرار می‌گیرند.دارای یک بومیکروفن در هر گوشی است که صدا را به طور واضح ضبط می‌کند",
      "AirPods با استفاده از تکنولوژی بلوتوث به دستگاه‌های مختلف متصل می‌شوند، از جمله آیفون، آیپد، مک‌بوک و دیگر دستگاه‌های دارای بلوتوث. اتصال بی‌سیم به کاربر امکان انجام فعالیت‌های روزمره را بدون محدودیت کابل‌ها می‌دهد.",

      "AirPods دارای قابلیت شارژ سریع هستند که با شارژ کردن مدت کوتاهی می‌توانید از آن‌ها برای مدت طولانی استفاده کنید.",
    ],

    brand: "apple",
    category: "Electronic",
    price: 37000000,
    countInStock: 2,
    rating: 3,
    numReviews: 5,
  },
];
