describe("check", () => {
  beforeEach(() => {
    cy.visit("/questions");
  });
  it("dropdown", () => {
    cy.contains(
      /شما میتواتید در بخش تماس با ما با ما ارتباط برقرار کنید/i
    ).should("not.be.visible");

    cy.contains("چطونه میتوانم با پشتیانی تماس بگیرم").click();
    cy.contains(
      /شما میتواتید در بخش تماس با ما با ما ارتباط برقرار کنید/i
    ).should("be.visible");
  });
  ///
  it("dropdown", () => {
    cy.contains(
      /روی گزینه سفارش‌های من کلیک کنید. در این قسمت با کلیک روی جزییات می‌توانید سفارش خود را ببینید. می‌توانید در این قسمت روند آماده‌سازی و مراحل ارسال سفارش خود را پیگیری کنید/i
    ).should("not.be.visible");

    cy.contains("چطور می‌توانم سفارشم را پیگیری کنم؟").click();

    cy.contains(
      /روی گزینه سفارش‌های من کلیک کنید. در این قسمت با کلیک روی جزییات می‌توانید سفارش خود را ببینید. می‌توانید در این قسمت روند آماده‌سازی و مراحل ارسال سفارش خود را پیگیری کنید/i
    ).should("be.visible");
  });
});
